Revit 2027 API
FabricationPart.Flip Method
 Flips the fabrication part that is directionally oriented (tees, crosses, valves, dampers, etc.) to the opposite direction.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool Flip()
Public Function Flip As Boolean
public:
bool Flip()
member Flip : unit -> bool
Return Value
Boolean
 Returns true if successful otherwise false if the fabrication part cannot be flipped.
Exceptions
Exception | Condition
InvalidOperationException |  It is not a valid part that can be flipped.
Remarks
 Existing connections will be maintained, disconnect warnings will be posted if the connection cannot be maintained.
See Also
Reference
FabricationPart Class
Autodesk.Revit.DB Namespace